{
  "layouts": [
    {
      "id": "constraintlayout",
      "titulo": "ConstraintLayout",
      "descripcion": "Es el 'organizador' de la pantalla. Te permite posicionar cada elemento creando 'relaciones' o 'anclas' con otros elementos o con los bordes. Es el equivalente al Auto Layout de Figma."
    },
    {
      "id": "linearlayout",
      "titulo": "LinearLayout",
      "descripcion": "Un organizador simple que apila los elementos uno detrás de otro de forma secuencial, ya sea en una columna vertical o en una fila horizontal."
    },
    {
      "id": "framelayout",
      "titulo": "FrameLayout",
      "descripcion": "Un contenedor para superponer elementos (como capas). El último elemento añadido se dibuja encima de los anteriores."
    }
  ],
  "botones": [
    {
      "id": "button",
      "titulo": "Button",
      "descripcion": "El botón estándar con texto para acciones claras como 'Aceptar' o 'Siguiente'."
    },
    {
      "id": "imagebutton",
      "titulo": "ImageButton",
      "descripcion": "Un botón que solo contiene un icono o imagen. Ideal para botones de 'Cerrar' o redes sociales."
    },
    {
      "id": "fab",
      "titulo": "FloatingActionButton",
      "descripcion": "El botón circular que flota sobre la interfaz para la acción principal, como redactar un mensaje."
    }
  ],
  "componentes_ui": [
    {
      "id": "textview",
      "titulo": "TextView",
      "descripcion": "Etiqueta para mostrar texto estático que el usuario no puede modificar."
    },
    {
      "id": "edittext",
      "titulo": "EditText",
      "descripcion": "Campo de entrada donde el usuario puede escribir texto, correos o contraseñas."
    },
    {
      "id": "imageview",
      "titulo": "ImageView",
      "descripcion": "Componente para mostrar fotos, ilustraciones o iconos vectoriales."
    },
    {
      "id": "scrollview",
      "titulo": "ScrollView",
      "descripcion": "Un contenedor que permite al usuario hacer scroll si el contenido es más alto que la pantalla física."
    }
  ],
  "notificaciones_ui": [
    {
      "id": "toast",
      "titulo": "Toast",
      "descripcion": "Un pequeño mensaje flotante que aparece en la parte inferior y desaparece solo tras unos segundos. Útil para avisos rápidos."
    },
    {
      "id": "snackbar",
      "titulo": "Snackbar",
      "descripcion": "Similar al Toast, pero permite incluir una acción (como 'Deshacer') y visualmente está más integrado con Material Design."
    }
  ],
  "activities_y_ciclo": [
    {
      "id": "activity",
      "titulo": "Activity",
      "descripcion": "Representa una pantalla de la app. Es el contenedor donde vive tu diseño y la lógica de interacción."
    },
    {
      "id": "oncreate",
      "titulo": "onCreate()",
      "descripcion": "El momento en que la pantalla nace. Aquí se infla el diseño XML y se preparan los componentes."
    },
    {
      "id": "onstart",
      "titulo": "onStart()",
      "descripcion": "La pantalla está a punto de ser visible para el usuario."
    },
    {
      "id": "onresume",
      "titulo": "onResume()",
      "descripcion": "La pantalla ya es visible y está lista para que el usuario interactúe con ella."
    },
    {
      "id": "onpause",
      "titulo": "onPause()",
      "descripcion": "El usuario está saliendo de la pantalla. Se usa para pausar tareas que no deben seguir activas."
    },
    {
      "id": "onstop",
      "titulo": "onStop()",
      "descripcion": "La pantalla ya no es visible, pero sigue en memoria."
    },
    {
      "id": "ondestroy",
      "titulo": "onDestroy()",
      "descripcion": "La pantalla se cierra definitivamente y se libera el espacio en memoria."
    }
  ],
  "archivos_y_configuracion": [
    {
      "id": "android_manifest",
      "titulo": "AndroidManifest.xml",
      "descripcion": "El archivo de identidad de la app. Define el icono, el nombre, los permisos y las pantallas existentes."
    },
    {
      "id": "gradle",
      "titulo": "Gradle",
      "descripcion": "El sistema que compila la app. Aquí se gestionan las librerías externas y versiones de Android."
    },
    {
      "id": "colors_xml",
      "titulo": "colors.xml",
      "descripcion": "La paleta cromática centralizada para mantener la consistencia visual en toda la app."
    }
  ],
  "programacion_poo": [
    {
      "id": "clase",
      "titulo": "Clase",
      "descripcion": "Es el molde o plano. Define qué es un objeto y qué puede hacer."
    },
    {
      "id": "instancia",
      "titulo": "Instancia / Objeto",
      "descripcion": "Es el elemento real creado con el molde. La clase es el plano de una silla, la instancia es la silla donde te sientas."
    },
    {
      "id": "constructor",
      "titulo": "Constructor",
      "descripcion": "La función que se encarga de inicializar el objeto cuando se crea por primera vez."
    },
    {
      "id": "herencia",
      "titulo": "Herencia",
      "descripcion": "Permite que una clase tome características de otra. Por ejemplo, un Coche hereda de Vehículo."
    },
    {
      "id": "override",
      "titulo": "Override",
      "descripcion": "Significa 'sobrescribir'. Se usa para cambiar el comportamiento de una función que hemos heredado de otra clase."
    },
    {
      "id": "singleton",
      "titulo": "Singleton",
      "descripcion": "Un patrón que asegura que solo exista una única instancia de una clase en toda la aplicación."
    }
  ],
  "tipos_de_datos": [
    {
      "id": "int",
      "titulo": "Int",
      "descripcion": "Números enteros sin decimales (ej: 1, 10, -500)."
    },
    {
      "id": "double",
      "titulo": "Double",
      "descripcion": "Números con decimales de alta precisión (ej: 3.1416)."
    },
    {
      "id": "boolean",
      "titulo": "Boolean",
      "descripcion": "Valores lógicos que solo pueden ser verdaderos (true) o falsos (false)."
    },
    {
      "id": "string",
      "titulo": "String",
      "descripcion": "Cadenas de texto o caracteres (ej: 'Hola Mundo')."
    }
  ],
  "kotlin_avanzado_y_log": [
    {
      "id": "corrutinas",
      "titulo": "Corrutinas",
      "descripcion": "Permiten realizar tareas pesadas (como descargar datos) en segundo plano sin bloquear la interfaz."
    },
    {
      "id": "log_d",
      "titulo": "Log.d()",
      "descripcion": "Una herramienta de depuración que imprime mensajes ocultos en la consola para que los desarrolladores vean qué está pasando internamente."
    },
    {
      "id": "null_safety",
      "titulo": "Null Safety",
      "descripcion": "El sistema de Kotlin para evitar que la app se cuelgue cuando intenta acceder a datos que no existen."
    }
  ]
}
